## Basic EDA - Pandas

In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [11]:
df = pd.read_excel("df_missing_values.xlsx" , parse_dates=['timestamp'] , index_col=[0])

# index_col=[0] takes the first column in the file as index else it will generate auto-index values

In [12]:
df.head(10)

        one       two     three four   five  timestamp
a  0.469112 -0.282863 -1.509059  bar   True 2012-01-01
c -1.135632  1.212112 -0.173215  bar  False 2012-01-01
e  0.119209 -1.044236 -0.861849  bar   True 2012-01-01
f -2.104569 -0.494929  1.071804  bar  False 2012-01-01
h  0.721555 -0.706771 -1.039575  bar   True 2012-01-01

In [16]:
df.loc[['a','c','h'],['one','timestamp']] = np.nan

In [17]:
df.head()

        one       two     three four   five  timestamp
a       NaN -0.282863 -1.509059  bar   True        NaT
c       NaN  1.212112 -0.173215  bar  False        NaT
e  0.119209 -1.044236 -0.861849  bar   True 2012-01-01
f -2.104569 -0.494929  1.071804  bar  False 2012-01-01
h       NaN -0.706771 -1.039575  bar   True        NaT

## Important Pandas Function

### Null Value in the DataFrame

In [19]:
df.isnull()

     one    two  three   four   five  timestamp
a   True  False  False  False  False       True
c   True  False  False  False  False       True
e  False  False  False  False  False      False
f  False  False  False  False  False      False
h   True  False  False  False  False       True

In [22]:
df.isnull().sum() # Returns the number of null values in each column

one          3
two          0
three        0
four         0
five         0
timestamp    3
dtype: int64

In [23]:
df.isna()

     one    two  three   four   five  timestamp
a   True  False  False  False  False       True
c   True  False  False  False  False       True
e  False  False  False  False  False      False
f  False  False  False  False  False      False
h   True  False  False  False  False       True

In [24]:
df.isna().sum()

one          3
two          0
three        0
four         0
five         0
timestamp    3
dtype: int64

In [25]:
df.notnull()

     one   two  three  four  five  timestamp
a  False  True   True  True  True      False
c  False  True   True  True  True      False
e   True  True   True  True  True       True
f   True  True   True  True  True       True
h  False  True   True  True  True      False

In [27]:
df.notnull().sum() # Returns the number of NOT-NULL values in each column

one          2
two          5
three        5
four         5
five         5
timestamp    2
dtype: int64

In [29]:
## Do not compare NAN with NAN , IT ALWAYS GIVES FALSE

np.nan == np.nan

False

In [35]:
None == None # But None will give True

True

## Fill NAs

In [36]:
df.head()

        one       two     three four   five  timestamp
a       NaN -0.282863 -1.509059  bar   True        NaT
c       NaN  1.212112 -0.173215  bar  False        NaT
e  0.119209 -1.044236 -0.861849  bar   True 2012-01-01
f -2.104569 -0.494929  1.071804  bar  False 2012-01-01
h       NaN -0.706771 -1.039575  bar   True        NaT

In [38]:
df.fillna(0) # Fills missing NAs with the number/string given in the bracket

        one       two     three four   five            timestamp
a  0.000000 -0.282863 -1.509059  bar   True                    0
c  0.000000  1.212112 -0.173215  bar  False                    0
e  0.119209 -1.044236 -0.861849  bar   True  2012-01-01 00:00:00
f -2.104569 -0.494929  1.071804  bar  False  2012-01-01 00:00:00
h  0.000000 -0.706771 -1.039575  bar   True                    0

In [39]:
df.head()

        one       two     three four   five  timestamp
a       NaN -0.282863 -1.509059  bar   True        NaT
c       NaN  1.212112 -0.173215  bar  False        NaT
e  0.119209 -1.044236 -0.861849  bar   True 2012-01-01
f -2.104569 -0.494929  1.071804  bar  False 2012-01-01
h       NaN -0.706771 -1.039575  bar   True        NaT

In [40]:
df.fillna('missing')

        one       two     three four   five            timestamp
a   missing -0.282863 -1.509059  bar   True              missing
c   missing  1.212112 -0.173215  bar  False              missing
e  0.119209 -1.044236 -0.861849  bar   True  2012-01-01 00:00:00
f  -2.10457 -0.494929  1.071804  bar  False  2012-01-01 00:00:00
h   missing -0.706771 -1.039575  bar   True              missing

## Forward Fill

In [42]:
df.ffill() # Wherever the NAN is present it will be filled by its PRECEEDING values .If no preceeding values ot remains SAME

        one       two     three four   five  timestamp
a       NaN -0.282863 -1.509059  bar   True        NaT
c       NaN  1.212112 -0.173215  bar  False        NaT
e  0.119209 -1.044236 -0.861849  bar   True 2012-01-01
f -2.104569 -0.494929  1.071804  bar  False 2012-01-01
h -2.104569 -0.706771 -1.039575  bar   True 2012-01-01

## Backward Fill

In [43]:
df.head()

        one       two     three four   five  timestamp
a       NaN -0.282863 -1.509059  bar   True        NaT
c       NaN  1.212112 -0.173215  bar  False        NaT
e  0.119209 -1.044236 -0.861849  bar   True 2012-01-01
f -2.104569 -0.494929  1.071804  bar  False 2012-01-01
h       NaN -0.706771 -1.039575  bar   True        NaT

In [45]:
df.bfill()# Wherever the NAN is present it will be filled by its NEXT values .If no preceeding values ot remains SAME

        one       two     three four   five  timestamp
a  0.119209 -0.282863 -1.509059  bar   True 2012-01-01
c  0.119209  1.212112 -0.173215  bar  False 2012-01-01
e  0.119209 -1.044236 -0.861849  bar   True 2012-01-01
f -2.104569 -0.494929  1.071804  bar  False 2012-01-01
h       NaN -0.706771 -1.039575  bar   True        NaT

In [47]:
df.bfill(limit=1) # Limits to ONLY ONE row/place

        one       two     three four   five  timestamp
a       NaN -0.282863 -1.509059  bar   True        NaT
c  0.119209  1.212112 -0.173215  bar  False 2012-01-01
e  0.119209 -1.044236 -0.861849  bar   True 2012-01-01
f -2.104569 -0.494929  1.071804  bar  False 2012-01-01
h       NaN -0.706771 -1.039575  bar   True        NaT

## Drop NAs

In [48]:
df.dropna() # Drops the rows with NAN values

        one       two     three four   five  timestamp
e  0.119209 -1.044236 -0.861849  bar   True 2012-01-01
f -2.104569 -0.494929  1.071804  bar  False 2012-01-01

In [49]:
df

        one       two     three four   five  timestamp
a       NaN -0.282863 -1.509059  bar   True        NaT
c       NaN  1.212112 -0.173215  bar  False        NaT
e  0.119209 -1.044236 -0.861849  bar   True 2012-01-01
f -2.104569 -0.494929  1.071804  bar  False 2012-01-01
h       NaN -0.706771 -1.039575  bar   True        NaT

In [50]:
df.dropna(axis=0) # By default axis =0 (Row)

        one       two     three four   five  timestamp
e  0.119209 -1.044236 -0.861849  bar   True 2012-01-01
f -2.104569 -0.494929  1.071804  bar  False 2012-01-01

In [52]:
df.dropna(axis=1) # Drops the Columns with NAN values

        two     three four   five
a -0.282863 -1.509059  bar   True
c  1.212112 -0.173215  bar  False
e -1.044236 -0.861849  bar   True
f -0.494929  1.071804  bar  False
h -0.706771 -1.039575  bar   True

## Replace Function with SERIES

In [55]:
ser = pd.Series([1,4,7,2,5]) # Defining a series

In [56]:
ser

0    1
1    4
2    7
3    2
4    5
dtype: int64

In [57]:
ser.replace(1,5)

0    5
1    4
2    7
3    2
4    5
dtype: int64

In [59]:
ser.replace([5,7,5],['odd','odd','odd'])

0      1
1      4
2    odd
3      2
4    odd
dtype: object

In [60]:
ser.replace([1,7,5],['odd','odd','odd'])

0    odd
1      4
2    odd
3      2
4    odd
dtype: object

In [61]:
ser

0    1
1    4
2    7
3    2
4    5
dtype: int64

In [64]:
ser.replace([1,7,5],['odd','odd','odd'] , inplace=True) # INPLACE function makes the changes in the original series

In [65]:
ser

0    odd
1      4
2    odd
3      2
4    odd
dtype: object

In [67]:
# Replacing using Dictionaries (Commonly used)

ser.replace({'odd':1 , 'odd':3 , 'odd':5})

0    5
1    4
2    5
3    2
4    5
dtype: int64

## Replace Function with DATAFRAME

In [69]:
df1 = pd.DataFrame({'a' :[1,2,3,4,5,6], 'b':[7,8,9,10,11,12]})

In [70]:
df1

   a   b
0  1   7
1  2   8
2  3   9
3  4  10
4  5  11
5  6  12

In [75]:
df1.replace({'a':1 , 'b':12},100 , inplace=True)
df1.replace({'a':2 , 'b':12},100 , inplace=True)

In [76]:
df1

     a    b
0  100    7
1  100    8
2    3    9
3    4   10
4    5   11
5    6  100

In [77]:
df1.replace([3,4,5],method='ffill') # Replaing with the previous value

     a    b
0  100    7
1  100    8
2  100    9
3  100   10
4  100   11
5    6  100

In [80]:
df1.replace([8,9,10],method='bfill' , limit=2) # Replaing with the below value

     a    b
0  100    7
1  100    8
2    3   11
3    4   11
4    5   11
5    6  100

## Column Renaming

In [82]:
df2 = pd.read_excel("df_missing_values.xlsx" , parse_dates=['timestamp'] , index_col=[0])

In [83]:
df2.head()

        one       two     three four   five  timestamp
a  0.469112 -0.282863 -1.509059  bar   True 2012-01-01
c -1.135632  1.212112 -0.173215  bar  False 2012-01-01
e  0.119209 -1.044236 -0.861849  bar   True 2012-01-01
f -2.104569 -0.494929  1.071804  bar  False 2012-01-01
h  0.721555 -0.706771 -1.039575  bar   True 2012-01-01

## Rename Function

In [84]:
df2.rename(columns={"one":1 , "two": 2})

          1         2     three four   five  timestamp
a  0.469112 -0.282863 -1.509059  bar   True 2012-01-01
c -1.135632  1.212112 -0.173215  bar  False 2012-01-01
e  0.119209 -1.044236 -0.861849  bar   True 2012-01-01
f -2.104569 -0.494929  1.071804  bar  False 2012-01-01
h  0.721555 -0.706771 -1.039575  bar   True 2012-01-01

In [85]:
df2.head()

        one       two     three four   five  timestamp
a  0.469112 -0.282863 -1.509059  bar   True 2012-01-01
c -1.135632  1.212112 -0.173215  bar  False 2012-01-01
e  0.119209 -1.044236 -0.861849  bar   True 2012-01-01
f -2.104569 -0.494929  1.071804  bar  False 2012-01-01
h  0.721555 -0.706771 -1.039575  bar   True 2012-01-01

## Bulk Rename

In [89]:
df2.rename(columns= lambda x : x.upper(), inplace=True)
df2

        ONE       TWO     THREE FOUR   FIVE  TIMESTAMP
a  0.469112 -0.282863 -1.509059  bar   True 2012-01-01
c -1.135632  1.212112 -0.173215  bar  False 2012-01-01
e  0.119209 -1.044236 -0.861849  bar   True 2012-01-01
f -2.104569 -0.494929  1.071804  bar  False 2012-01-01
h  0.721555 -0.706771 -1.039575  bar   True 2012-01-01

In [90]:
df2.rename(columns= lambda x : x.lower())

        one       two     three four   five  timestamp
a  0.469112 -0.282863 -1.509059  bar   True 2012-01-01
c -1.135632  1.212112 -0.173215  bar  False 2012-01-01
e  0.119209 -1.044236 -0.861849  bar   True 2012-01-01
f -2.104569 -0.494929  1.071804  bar  False 2012-01-01
h  0.721555 -0.706771 -1.039575  bar   True 2012-01-01

## To replace with spaces and special characters

In [ ]:
# To remove white spaces:

df.columns = df.columns.str.replace(' ', '') # To remove white space everywhere


df.columns = df.columns.str.lstrip() # To remove white space at the beginning of string



df.columns = df.columns.str.rstrip() # To remove white space at the end of string



df.columns = df.columns.str.strip() #  To remove white space at both ends

# To replace white spaces with other characters (underscore for instance):


df.columns = df.columns.str.replace(' ', '_') #  To replace white space everywhere


df.columns = df.columns.str.replace('^ +', '_') # To replace white space at the beginning


df.columns = df.columns.str.replace(' +$', '_') # To replace white space at the end


df.columns = df.columns.str.replace('^ +| +$', '_') # To replace white space at both ends

## THE END OF CLASS APRIL25_2020